// 物品列表 (物品代码，物品名称，分解得到的碎片数量，合成需要的碎片数量）
const itemGroupList = Array(
    Array(
        "头盔",
        Array(
            Array(2040028, "70%头盔敏捷卷轴", 1, 20),
            Array(2040029, "60%头盔敏捷卷轴", 1, 20),
            Array(2040030, "30%头盔敏捷卷轴", 1, 20),
            Array(2040031, "10%头盔敏捷卷轴", 1, 20),
            Array(2040043, "65%头盔敏捷卷轴", 1, 25),
            Array(2040044, "15%头盔敏捷卷轴", 1, 25),
            Array(2040012, "70%头盔智力卷轴", 1, 20),
            Array(2040013, "30%头盔智力卷轴", 1, 20),
            Array(2040025, "60%头盔智力卷轴", 1, 20),
            Array(2040026, "10%头盔智力卷轴", 1, 20),
            Array(2040000, "100%头盔防御卷轴", 1, 2),
            Array(2040001, "60%头盔防御卷轴", 1, 5),
            Array(2040002, "10%头盔防御卷轴", 1, 5),
            Array(2040003, "100%头盔体力卷轴", 1, 2),
            Array(2040004, "60%头盔体力卷轴", 1, 5),
            Array(2040005, "10%头盔体力卷轴", 1, 5),
            Array(2040006, "100%头盔防御卷轴", 1, 20),
            Array(2040007, "100%头盔体力卷轴", 1, 20),
            Array(2040008, "70%头盔防御诅咒卷轴", 1, 5),
            Array(2040009, "30%头盔防御诅咒卷轴", 1, 5),
            Array(2040010, "70%头盔体力诅咒卷轴", 1, 5),
            Array(2040011, "30%头盔体力诅咒卷轴", 1, 5),
            Array(2040014, "70%头盔命中率诅咒卷轴", 1, 20),
            Array(2040015, "30%头盔命中率诅咒卷轴", 1, 20),
            Array(2040016, "10%头盔命中率卷轴", 1, 20),
            Array(2040017, "60%头盔命中率卷轴", 1, 20),
            Array(2040019, "65%头盔防御卷轴", 1, 6),
            Array(2040020, "15%头盔防御卷轴", 1, 6),
            Array(2040021, "65%头盔体力卷轴", 1, 6),
            Array(2040022, "15%头盔体力卷轴", 1, 6),
            Array(2040041, "100%头盔防御卷轴", 1, 10),
            Array(2040042, "100%头盔体力卷轴", 1, 10),
            Array(2040045, "50%头盔防御卷轴", 1, 10),
            Array(2040046, "50%头盔体力卷轴", 1, 10)
        )
    ),
    Array(
        "脸饰",
        Array(
            Array(2040100, "10%脸饰生命卷轴", 1, 10),
            Array(2040101, "60%脸饰生命卷轴", 1, 10),
            Array(2040102, "100%脸饰生命卷轴", 1, 10),
            Array(2040103, "30%脸饰生命诅咒卷轴", 1, 10),
            Array(2040104, "70%脸饰生命诅咒卷轴", 1, 10),
            Array(2040105, "10%脸饰回避率卷轴", 1, 20),
            Array(2040106, "60%脸饰回避率卷轴", 1, 20),
            Array(2040107, "100%脸饰回避卷轴", 1, 10),
            Array(2040108, "30%脸饰回避率诅咒卷轴", 1, 20),
            Array(2040109, "70%脸饰回避率诅咒卷轴", 1, 20)
        )
    ),
    Array(
        "眼饰",
        Array(
            Array(2040200, "10%眼饰命中率卷轴", 1, 20),
            Array(2040201, "60%眼饰命中率卷轴", 1, 10),
            Array(2040202, "100%眼饰命中率卷轴", 1, 10),
            Array(2040203, "30%眼饰命中率诅咒卷轴", 1, 20),
            Array(2040204, "70%眼饰命中率诅咒卷轴", 1, 10),
            Array(2040205, "10%眼饰智力卷轴", 1, 30),
            Array(2040206, "60%眼饰智力卷轴", 1, 50),
            Array(2040207, "100%眼饰智力卷轴", 1, 40),
            Array(2040208, "30%眼饰智力诅咒卷轴", 1, 20),
            Array(2040209, "70%眼饰智力诅咒卷轴", 1, 20)
        )
    ),
    Array(
        "耳环",
        Array(
            Array(2040300, "100%耳环智力卷轴", 1, 5),
            Array(2040301, "60%耳环智力卷轴", 1, 100),
            Array(2040313, "65%耳环智力卷轴", 1, 110),
            Array(2040302, "10%耳环智力卷轴", 1, 80),
            Array(2040330, "10%耳环智力卷轴", 1, 80),
            Array(2040314, "15%耳环智力卷轴", 1, 85),
            Array(2040303, "30%耳环智力卷轴", 1, 300),
            Array(2040334, "100%耳环智力必成卷轴", 1, 1000),
            Array(2040333, "50%耳环智力卷轴", 1, 1000),
            Array(2040304, "70%耳环智力诅咒卷轴", 1, 30),
            Array(2040305, "30%耳环智力诅咒卷轴", 1, 30),
            Array(2040319, "100%耳环运气卷轴", 1, 2),
            Array(2040320, "70%耳环运气卷轴", 1, 20),
            Array(2040321, "60%耳环运气卷轴", 1, 20),
            Array(2040322, "30%耳环运气卷轴", 1, 20),
            Array(2040323, "10%耳环运气卷轴", 1, 20),
            Array(2040331, "10%耳环运气卷轴", 1, 20),
            Array(2040337, "65%耳环运气卷轴", 1, 25),
            Array(2040338, "15%耳环运气卷轴", 1, 25),
            Array(2040306, "70%耳环敏捷卷轴", 1, 20),
            Array(2040307, "30%耳环敏捷卷轴", 1, 20),
            Array(2040316, "100%耳环敏捷卷轴", 1, 2),
            Array(2040317, "60%耳环敏捷卷轴", 1, 20),
            Array(2040318, "10%耳环敏捷卷轴", 1, 20),
            Array(2040329, "10%耳环敏捷卷轴", 1, 20),
            Array(2040335, "15%耳环敏捷卷轴", 1, 25),
            Array(2040336, "15%耳环敏捷卷轴", 1, 25),
            Array(2040308, "70%耳环防御力诅咒卷轴", 1, 5),
            Array(2040309, "30%耳环防御力诅咒卷轴", 1, 5),
            Array(2040310, "10%耳环防御力卷轴", 1, 5),
            Array(2040311, "60%耳环防御力卷轴", 1, 5),
            Array(2040312, "100%耳环防御力卷轴", 1, 5),
            Array(2040324, "100%耳环体力卷轴", 1, 5),
            Array(2040325, "70%耳环体力卷轴 ", 1, 5),
            Array(2040326, "60%耳环体力卷轴 ", 1, 5),
            Array(2040327, "30%耳环体力卷轴 ", 1, 5),
            Array(2040328, "10%耳环体力卷轴 ", 1, 5),
            Array(2040339, "65%耳环体力卷轴", 1, 6),
            Array(2040340, "15%耳环体力卷轴", 1, 6)
        )
    ),
    Array(
        "上衣",
        Array(
            Array(2040412, "10%上衣运气卷轴", 1, 20),
            Array(2040413, "60%上衣运气卷轴", 1, 20),
            Array(2040414, "100%上衣运气卷轴", 1, 20),
            Array(2040423, "100%上衣运气卷轴", 1, 20),
            Array(2040424, "70%上衣运气卷轴", 1, 20),
            Array(2040425, "60%上衣运气卷轴", 1, 20),
            Array(2040426, "30%上衣运气卷轴", 1, 20),
            Array(2040427, "10%上衣运气卷轴", 1, 20),
            Array(2040435, "65%上衣运气卷轴", 1, 25),
            Array(2040436, "15%上衣运气卷轴", 1, 25),
            Array(2040410, "70%上衣运气诅咒卷轴", 1, 20),
            Array(2040411, "30%上衣运气诅咒卷轴", 1, 20),
            Array(2040406, "70%上衣力量卷轴", 1, 20),
            Array(2040407, "30%上衣力量卷轴", 1, 20),
            Array(2040417, "100%上衣力量卷轴", 1, 20),
            Array(2040418, "60%上衣力量卷轴", 1, 20),
            Array(2040419, "10%上衣力量卷轴", 1, 20),
            Array(2040431, "65%上衣力量卷轴", 1, 20),
            Array(2040432, "15%上衣力量卷轴", 1, 20),
            Array(2040420, "100%上衣体力卷轴", 1, 5),
            Array(2040421, "60%上衣体力卷轴", 1, 5),
            Array(2040422, "10%上衣体力卷轴", 1, 10),
            Array(2040429, "50%上衣防御卷轴", 1, 20),
            Array(2040430, "60%上衣防御必成卷轴", 1, 20),
            Array(2040433, "65%上衣体力卷轴", 1, 6),
            Array(2040434, "15%上衣体力卷轴", 1, 6),
            Array(2040415, "65%上衣防御力卷轴", 1, 6),
            Array(2040416, "15%上衣防御力卷轴", 1, 6),
            Array(2040400, "100%上衣防御卷轴", 1, 5),
            Array(2040401, "60%上衣防御卷轴", 1, 5),
            Array(2040402, "10%上衣防御卷轴", 1, 5),
            Array(2040403, "100%上衣防御必成卷轴", 1, 20),
            Array(2040404, "70%上衣防御诅咒卷轴", 1, 5),
            Array(2040405, "30%上衣防御诅咒卷轴", 1, 5),
            Array(2040408, "70%上衣体力卷轴", 1, 5),
            Array(2040409, "30%上衣体力卷轴", 1, 5),
        )
    ),
    Array(
        "全身铠甲",
        Array(
            Array(2040512, "100%全身铠甲智力卷轴", 1, 2),
            Array(2040513, "60%全身铠甲智力卷轴", 1, 20),
            Array(2040514, "10%全身铠甲智力卷轴", 1, 20),
            Array(2040518, "70%全身盔甲智力卷轴", 1, 20),
            Array(2040519, "30%全身盔甲智力卷轴", 1, 20),
            Array(2040526, "65%全身盔甲智力卷轴", 1, 25),
            Array(2040527, "15%全身盔甲智力卷轴", 1, 25),
            Array(2040500, "100%全身铠甲敏捷卷轴", 1, 2),
            Array(2040501, "60%全身铠甲敏捷卷轴", 1, 20),
            Array(2040502, "10%全身铠甲敏捷卷轴", 1, 20),
            Array(2040503, "60%全身铠甲敏捷卷轴", 1, 2),
            Array(2040522, "65%全身盔甲敏捷卷轴", 1, 20),
            Array(2040523, "15%全身盔甲敏捷卷轴", 1, 20),
            Array(2040538, "100%全身铠甲敏捷必成卷轴", 1, 100),
            Array(2040506, "100%全身铠甲敏捷必成卷轴", 1, 2200),
            Array(2040542, "50%全身铠甲敏捷卷轴", 1, 800),
            Array(2040508, "70%全身铠甲敏捷诅咒卷轴", 1, 20),
            Array(2040509, "30%全身铠甲敏捷诅咒卷轴", 1, 20),
            Array(2040515, "100%全身铠甲运气卷轴", 1, 2),
            Array(2040516, "60%全身铠甲运气卷轴", 1, 20),
            Array(2040517, "10%全身铠甲运气卷轴", 1, 20),
            Array(2040520, "70%全身盔甲幸运卷轴", 1, 20),
            Array(2040521, "30%全身盔甲幸运卷轴", 1, 20),
            Array(2040528, "65%全身盔甲幸运卷轴", 1, 25),
            Array(2040529, "15%全身盔甲幸运卷轴", 1, 25),
            Array(2040530, "100%全身铠甲力量卷轴", 1, 2),
            Array(2040531, "70%全身盔甲力量卷轴", 1, 20),
            Array(2040532, "60%全身盔甲力量卷轴", 1, 20),
            Array(2040533, "30%全身盔甲力量卷轴", 1, 20),
            Array(2040534, "10%全身盔甲力量卷轴 ", 1, 20),
            Array(2040540, "65%全身盔甲力量卷轴", 1, 25),
            Array(2040541, "15%全身盔甲力量卷轴", 1, 25),
            Array(2040504, "60%全身铠甲防御卷轴", 1, 5),
            Array(2040505, "10%全身铠甲防御卷轴", 1, 5),
            Array(2040507, "30%全身盔甲防御卷轴", 1, 5),
            Array(2040524, "65%全身盔甲防御卷轴", 1, 6),
            Array(2040525, "15%全身盔甲防御卷轴", 1, 6),
            Array(2040539, "100%全身铠甲防御必成卷轴", 1, 20),
            Array(2040543, "50%全身铠甲防御卷轴", 1, 20),
            Array(2040510, "70%全身铠甲防御诅咒卷轴", 1, 5),
            Array(2040511, "30%全身铠甲防御诅咒卷轴", 1, 5),
        )
    ),
    Array(
        "裤裙",
        Array(
            Array(2040600, "100%裤裙防御卷轴", 1, 2),
            Array(2040601, "60%裤裙防御卷轴", 1, 5),
            Array(2040602, "10%裤裙防御卷轴", 1, 5),
            Array(2040603, "60%裤裙防御卷轴", 1, 20),
            Array(2040604, "70%裤裙防御诅咒卷轴", 1, 5),
            Array(2040605, "30%裤裙防御诅咒卷轴", 1, 5),
            Array(2040606, "70%裤裙跳跃诅咒卷轴", 1, 5),
            Array(2040607, "30%裤裙跳跃诅咒卷轴", 1, 5),
            Array(2040608, "70%裤裙体力诅咒卷轴", 1, 5),
            Array(2040609, "30%裤裙体力诅咒卷轴", 1, 5),
            Array(2040610, "70%裤裙敏捷诅咒卷轴", 1, 20),
            Array(2040611, "30%裤裙敏捷诅咒卷轴", 1, 20),
            Array(2040615, "65%裤裙防御卷轴", 1, 5),
            Array(2040616, "15%裤裙防御卷轴", 1, 5),
            Array(2040617, "100%裤裙跳跃卷轴", 1, 2),
            Array(2040618, "60%裤裙跳跃卷轴", 1, 5),
            Array(2040619, "10%裤裙跳跃卷轴", 1, 5),
            Array(2040620, "100%裤裙体力卷轴", 1, 5),
            Array(2040621, "60%裤裙体力卷轴", 1, 5),
            Array(2040622, "10%裤裙体力卷轴", 1, 5),
            Array(2040633, "65%裤裙体力卷轴", 1, 5),
            Array(2040634, "15%裤裙体力卷轴", 1, 5),
            Array(2040612, "10%裤裙敏捷卷轴", 1, 20),
            Array(2040613, "60%裤裙敏捷卷轴", 1, 20),
            Array(2040614, "100%裤裙敏捷卷轴", 1, 20),
            Array(2040623, "100%裤裙敏捷卷轴", 1, 20),
            Array(2040624, "70%裤裙敏捷卷轴", 1, 20),
            Array(2040625, "60%裤裙敏捷卷轴", 1, 20),
            Array(2040626, "30%裤裙敏捷卷轴", 1, 20),
            Array(2040627, "10%裤裙敏捷卷轴", 1, 20),
            Array(2040635, "65%裤裙敏捷卷轴", 1, 20),
            Array(2040636, "15%裤裙敏捷卷轴", 1, 20),
            Array(2040629, "50%裤裙防御卷轴", 1, 20),
            Array(2040630, "100%裤裙防御卷轴", 1, 20),
            Array(2040631, "65%裤裙跳跃卷轴", 1, 200),
            Array(2040632, "15%裤裙跳跃卷轴", 1, 20),
        )
    ),
    Array(
        "鞋子",
        Array(
            Array(2040758, "100%鞋子攻击卷轴", 1, 800),
            Array(2040759, "60%鞋子攻击卷轴", 1, 2000),
            Array(2040760, "10%鞋子攻击卷轴", 1, 500),
            Array(2040700, "100%鞋子敏捷度卷轴", 1, 2),
            Array(2040701, "60%鞋子敏捷度卷轴", 1, 5),
            Array(2040702, "10%鞋子敏捷度卷轴", 1, 5),
            Array(2040703, "60%鞋子跳跃卷轴", 1, 2),
            Array(2040704, "60%鞋子跳跃卷轴", 1, 10),
            Array(2040705, "10%鞋子跳跃卷轴", 1, 10),
            Array(2040706, "100%鞋子速度卷轴", 1, 2),
            Array(2040707, "60%鞋子速度卷轴", 1, 5),
            Array(2040708, "10%鞋子速度卷轴", 1, 5),
            Array(2040709, "100%鞋子敏捷必成卷轴", 1, 20),
            Array(2040710, "100%鞋子跳跃必成卷轴", 1, 200),
            Array(2040711, "100%鞋子敏速度必成卷轴", 1, 20),
            Array(2040712, "70%鞋子敏捷诅咒卷轴", 1, 5),
            Array(2040713, "30%鞋子敏捷诅咒卷轴", 1, 5),
            Array(2040714, "70%鞋子跳跃诅咒卷轴", 1, 10),
            Array(2040715, "30%鞋子跳跃诅咒卷轴", 1, 10),
            Array(2040716, "70%鞋子速度诅咒卷轴", 1, 5),
            Array(2040717, "30%鞋子速度诅咒卷轴", 1, 5),
            Array(2040718, "65%鞋子敏捷卷轴", 1, 5),
            Array(2040719, "15%鞋子敏捷卷轴", 1, 5),
            Array(2040720, "65%鞋子跳跃卷轴", 1, 10),
            Array(2040721, "15%鞋子跳跃卷轴", 1, 10),
            Array(2040722, "65%鞋子速度卷轴", 1, 5),
            Array(2040723, "15%鞋子速度卷轴", 1, 5),
            Array(2040727, "10%鞋子防滑卷轴", 1, 10),
            Array(2040740, "100%鞋子命中必成卷轴", 1, 20),
            Array(2040741, "100%鞋子跳跃必成卷轴", 1, 20),
            Array(2040742, "100%鞋子移动必成卷轴", 1, 10),
            Array(2040755, "50%鞋子敏捷卷轴", 1, 20),
            Array(2040756, "50%鞋子跳跃卷轴", 1, 20),
            Array(2040757, "50%鞋子移动卷轴", 1, 20),
        )
    ),
    Array(
        "手套",
        Array(
            Array(2040803, "100%手套攻击卷轴", 1, 50),
            Array(2040804, "60%手套攻击卷轴", 1, 150),
            Array(2040826, "60%手套攻击卷轴", 1, 150),
            Array(2040821, "65%手套攻击卷轴", 1, 160),
            Array(2040830, "100%手套攻击卷轴", 1, 300),
            Array(2040805, "10%手套攻击卷轴", 1, 100),
            Array(2040822, "15%手套攻击卷轴", 1, 150),
            Array(2040834, "50%手套攻击卷轴", 1, 1500),
            Array(2040807, "100%手套攻击卷轴", 1, 3200),
            Array(2040810, "70%手套攻击诅咒卷轴", 1, 50),
            Array(2040811, "30%手套攻击诅咒卷轴", 1, 50),
            Array(2040818, "100%手套魔力卷轴", 1, 20),
            Array(2040817, "60%手套魔力卷轴", 1, 100),
            Array(2040816, "10%手套魔力卷轴", 1, 80),
            Array(2040814, "70%手套魔力诅咒卷轴", 1, 20),
            Array(2040815, "30%手套魔力诅咒卷轴", 1, 20),
            Array(2040800, "100%手套敏捷卷轴", 1, 2),
            Array(2040801, "60%手套敏捷卷轴", 1, 5),
            Array(2040802, "10%手套敏捷卷轴", 1, 5),
            Array(2040806, "100%手套敏捷卷轴", 1, 10),
            Array(2040808, "70%手套敏捷诅咒卷轴", 1, 5),
            Array(2040809, "30%手套敏捷诅咒卷轴", 1, 5),
            Array(2040812, "70%手套体力卷轴", 1, 5),
            Array(2040813, "30%手套体力卷轴", 1, 5),
            Array(2040819, "65%手套敏捷卷轴", 1, 220),
            Array(2040820, "15%手套敏捷卷轴", 1, 5),
            Array(2040823, "100%手套体力卷轴", 1, 6),
            Array(2040824, "60%手套体力卷轴", 1, 6),
            Array(2040825, "10%手套体力卷轴", 1, 6),
            Array(2040829, "100%手套敏捷卷轴", 1, 20),
            Array(2040831, "65%手套体力卷轴", 1, 6),
            Array(2040832, "15%手套体力卷轴", 1, 6),
            Array(2040833, "50%手套敏捷卷轴", 1, 20),
        )
    ),
    Array(
        "盾牌",
        Array(
            Array(2040914, "60%盾牌攻击卷轴", 1, 300),
            Array(2040915, "10%盾牌攻击卷轴", 1, 200),
            Array(2040916, "70%盾牌攻击诅咒卷轴", 1, 80),
            Array(2040917, "30%盾牌攻击诅咒卷轴", 1, 70),
            Array(2040918, "100%盾牌魔力卷轴", 1, 20),
            Array(2040919, "60%盾牌魔力卷轴", 1, 200),
            Array(2040920, "10%盾牌魔力卷轴", 1, 200),
            Array(2040923, "100%盾牌运气卷轴", 1, 10),
            Array(2040924, "60%盾牌运气卷轴", 1, 10),
            Array(2040925, "10%盾牌运气卷轴", 1, 10),
            Array(2040937, "65%盾牌运气卷轴", 1, 12),
            Array(2040938, "15%盾牌运气卷轴", 1, 12),
            Array(2040906, "70%盾牌运气卷轴", 1, 20),
            Array(2040907, "30%盾牌运气卷轴", 1, 20),
            Array(2040929, "100%盾牌力量卷轴", 1, 10),
            Array(2040930, "70%盾牌力量卷轴", 1, 10),
            Array(2040931, "60%盾牌力量卷轴", 1, 10),
            Array(2040932, "30%盾牌力量卷轴", 1, 10),
            Array(2040933, "10%盾牌力量卷轴", 1, 10),
            Array(2040941, "65%盾牌力量卷轴", 1, 12),
            Array(2040942, "15%盾牌力量卷轴", 1, 12),
            Array(2040900, "100%盾牌防御卷轴", 1, 2),
            Array(2040901, "60%盾牌防御卷轴", 1, 5),
            Array(2040902, "10%盾牌防御卷轴", 1, 5),
            Array(2040903, "100%盾牌防御卷轴", 1, 20),
            Array(2040904, "70%盾牌防御诅咒卷轴", 1, 5),
            Array(2040905, "30%盾牌防御诅咒卷轴", 1, 5),
            Array(2040908, "70%盾牌体力卷轴", 1, 70),
            Array(2040909, "30%盾牌体力卷轴", 1, 5),
            Array(2040910, "65%盾牌防御卷轴", 1, 5),
            Array(2040911, "15%盾牌防御卷轴", 1, 5),
            Array(2040921, "70%盾牌魔力诅咒卷轴", 1, 70),
            Array(2040922, "30%盾牌魔力诅咒卷轴", 1, 60),
            Array(2040926, "100%盾牌体力卷轴", 1, 5),
            Array(2040927, "60%盾牌体力卷轴", 1, 5),
            Array(2040928, "10%盾牌体力卷轴", 1, 5),
            Array(2040936, "100%盾牌防御卷轴", 1, 5),
            Array(2040939, "65%盾牌体力卷轴", 1, 6),
            Array(2040940, "15%盾牌体力卷轴", 1, 6),
            Array(2040943, "50%盾牌防御卷轴", 1, 10)
        )
    ),
    Array(
        "披风",
        Array(
            Array(2041000, "100%披风魔防卷轴", 1, 2),
            Array(2041001, "60%披风魔防卷轴", 1, 5),
            Array(2041002, "10%披风魔防卷轴", 1, 5),
            Array(2041003, "100%披风防御卷轴", 1, 2),
            Array(2041004, "60%披风防御卷轴", 1, 5),
            Array(2041005, "10%披风防御卷轴", 1, 5),
            Array(2041006, "100%披风体力卷轴", 1, 2),
            Array(2041007, "60%披风体力卷轴", 1, 5),
            Array(2041008, "10%披风体力卷轴", 1, 5),
            Array(2041009, "100%披风魔力卷轴", 1, 2),
            Array(2041010, "60%披风魔力卷轴", 1, 5),
            Array(2041011, "10%披风魔力卷轴", 1, 5),
            Array(2041012, "100%披风力量卷轴", 1, 20),
            Array(2041013, "60%披风力量卷轴", 1, 40),
            Array(2041014, "10%披风力量卷轴", 1, 50),
            Array(2041015, "100%披风智力卷轴", 1, 20),
            Array(2041016, "60%披风智力卷轴", 1, 40),
            Array(2041017, "10%披风智力卷轴", 1, 50),
            Array(2041018, "100%披风敏捷卷轴", 1, 20),
            Array(2041019, "60%披风敏捷卷轴", 1, 40),
            Array(2041020, "10%披风敏捷卷轴", 1, 50),
            Array(2041021, "100%披风运气卷轴", 1, 20),
            Array(2041022, "60%披风运气卷轴", 1, 40),
            Array(2041023, "10%披风运气卷轴", 1, 50),
            Array(2041024, "100%披风魔防卷轴", 1, 20),
            Array(2041025, "100%披风防御卷轴", 1, 20),
            Array(2041026, "70%披风魔防诅咒卷轴", 1, 5),
            Array(2041027, "30%披风魔防诅咒卷轴", 1, 5),
            Array(2041028, "70%披风防御诅咒卷轴", 1, 5),
            Array(2041029, "30%披风防御诅咒卷轴", 1, 5),
            Array(2041030, "70%披风体力诅咒卷轴", 1, 5),
            Array(2041031, "30%披风体力诅咒卷轴", 1, 5),
            Array(2041032, "70%披风魔力诅咒卷轴", 1, 5),
            Array(2041033, "30%披风魔力诅咒卷轴", 1, 5),
            Array(2041034, "70%披风力量诅咒卷轴", 1, 20),
            Array(2041035, "30%披风力量诅咒卷轴", 1, 20),
            Array(2041036, "70%披风智力诅咒卷轴", 1, 20),
            Array(2041037, "30%披风智力诅咒卷轴", 1, 20),
            Array(2041038, "70%披风敏捷诅咒卷轴", 1, 20),
            Array(2041039, "30%披风敏捷诅咒卷轴", 1, 20),
            Array(2041040, "70%披风运气诅咒卷轴", 1, 20),
            Array(2041041, "30%披风运气诅咒卷轴", 1, 20),
            Array(2041042, "65%披风魔法防御卷轴", 1, 5),
            Array(2041043, "15%披风魔法防御卷轴", 1, 5),
            Array(2041044, "65%披风物理防御卷轴", 1, 5),
            Array(2041045, "15%披风物理防御卷轴", 1, 5),
            Array(2041046, "65%披风体力卷轴", 1, 6),
            Array(2041047, "15%披风体力卷轴", 1, 6),
            Array(2041048, "65%披风魔力卷轴", 1, 6),
            Array(2041049, "15%披风魔力卷轴", 1, 6),
            Array(2041050, "65%披风力量卷轴", 1, 50),
            Array(2041051, "15%披风力量卷轴", 1, 60),
            Array(2041052, "65%披风智力卷轴", 1, 50),
            Array(2041053, "15%披风智力卷轴", 1, 60),
            Array(2041054, "65%披风敏捷卷轴", 1, 50),
            Array(2041055, "15%披风敏捷卷轴", 1, 50),
            Array(2041056, "65%披风幸运卷轴", 1, 25),
            Array(2041057, "15%披风幸运卷轴", 1, 60),
            Array(2041058, "10%披风防寒卷轴", 1, 5),
            Array(2041066, "100%披风魔防卷轴", 1, 15),
            Array(2041067, "100%披风防御卷轴", 1, 15),
            Array(2041068, "50%披风魔法防御卷轴", 1, 15),
            Array(2041069, "50%披风物理防御卷轴", 1, 15)
        )
    ),
    Array(
        "戒指",
        Array(
            Array(2041100, "100%戒指力量卷轴", 1, 20),
            Array(2041101, "60%戒指力量卷轴", 1, 20),
            Array(2041102, "10%戒指力量卷轴", 1, 20),
            Array(2041103, "100%戒指智力卷轴", 1, 20),
            Array(2041104, "60%戒指智力卷轴", 1, 20),
            Array(2041105, "10%戒指智力卷轴", 1, 20),
            Array(2041106, "100%戒指敏捷卷轴", 1, 20),
            Array(2041107, "60%戒指敏捷卷轴", 1, 20),
            Array(2041108, "10%戒指敏捷卷轴", 1, 20),
            Array(2041109, "60%戒指运气卷轴", 1, 20),
            Array(2041110, "60%戒指运气卷轴", 1, 20),
            Array(2041111, "10%戒指运气卷轴", 1, 20),
            Array(2041112, "70%戒指力量诅咒卷轴", 1, 20),
            Array(2041113, "30%戒指力量诅咒卷轴", 1, 20),
            Array(2041114, "70%戒指智力诅咒卷轴", 1, 20),
            Array(2041115, "30%戒指智力诅咒卷轴", 1, 20),
            Array(2041116, "70%戒指敏捷诅咒卷轴", 1, 20),
            Array(2041117, "30%戒指敏捷诅咒卷轴", 1, 20),
            Array(2041118, "70%戒指运气诅咒卷轴", 1, 20),
            Array(2041119, "30%戒指运气诅咒卷轴", 1, 20)
        )
    ),
    Array(
        "腰带",
        Array(
            Array(2041300, "100%腰带力量卷轴", 1, 20),
            Array(2041301, "60%腰带力量卷轴", 1, 20),
            Array(2041302, "10%腰带力量卷轴", 1, 20),
            Array(2041303, "100%腰带智力卷轴", 1, 20),
            Array(2041304, "60%腰带智力卷轴", 1, 20),
            Array(2041305, "10%腰带智力卷轴", 1, 20),
            Array(2041306, "100%腰带敏捷卷轴", 1, 20),
            Array(2041307, "60%腰带敏捷卷轴", 1, 20),
            Array(2041308, "10%腰带敏捷卷轴", 1, 20),
            Array(2041309, "100%腰带运气卷轴", 1, 20),
            Array(2041310, "60%腰带运气卷轴", 1, 20),
            Array(2041311, "10%腰带运气卷轴", 1, 20),
            Array(2041312, "70%腰带力量诅咒卷轴", 1, 20),
            Array(2041313, "30%腰带力量诅咒卷轴", 1, 20),
            Array(2041314, "70%腰带智力诅咒卷轴", 1, 20),
            Array(2041315, "30%腰带智力诅咒卷轴", 1, 20),
            Array(2041316, "70%腰带敏捷诅咒卷轴", 1, 20),
            Array(2041317, "30%腰带敏捷诅咒卷轴", 1, 20),
            Array(2041318, "70%腰带运气诅咒卷轴", 1, 20),
            Array(2041319, "30%腰带运气诅咒卷轴", 1, 20)
        )
    ),

    Array(
        "单手剑",
        Array(
            Array(2043000, "100%单手剑攻击卷轴", 1, 2),
            Array(2043001, "60%单手剑攻击卷轴", 1, 100),
            Array(2043011, "65%单手剑攻击卷轴", 1, 120),
            Array(2043023, "100%单手剑攻击卷轴", 1, 320),
            Array(2043002, "10%单手剑攻击卷轴", 1, 50),
            Array(2043012, "15%单手剑攻击卷轴", 1, 60),
            Array(2043022, "50%单手剑攻击卷轴", 1, 1800),
            Array(2043003, "100%单手剑攻击卷轴", 1, 3000),
            Array(2043004, "70%单手剑攻击诅咒卷轴", 1, 20),
            Array(2043005, "30%单手剑攻击诅咒卷轴", 1, 20),
            Array(2043006, "70%单手剑魔力诅咒卷轴", 1, 20),
            Array(2043007, "30%单手剑魔力诅咒卷轴", 1, 20),
            Array(2043008, "10%单手剑魔力卷轴", 1, 20),
            Array(2043009, "60%单手剑魔力卷轴", 1, 20),
            Array(2043010, "100%单手剑魔力卷轴", 1, 2),
            Array(2043015, "100%单手剑命中率卷轴", 1, 2),
            Array(2043016, "70%单手剑命中率卷轴", 1, 10),
            Array(2043017, "60%单手剑命中率卷轴", 1, 10),
            Array(2043018, "30%单手剑命中率卷轴", 1, 10),
            Array(2043019, "10%单手剑命中率卷轴", 1, 10),
            Array(2043024, "65%单手剑命中卷轴", 1, 15),
            Array(2043025, "15%单手剑命中卷轴", 1, 15),
        )
    ),
    Array(
        "单手斧",
        Array(
            Array(2043100, "100%单手斧攻击卷轴", 1, 2),
            Array(2043101, "60%单手斧攻击卷轴", 1, 100),
            Array(2043106, "65%单手斧攻击卷轴", 1, 120),
            Array(2043117, "100%单手斧攻击卷轴", 1, 320),
            Array(2043102, "10%单手斧攻击卷轴", 1, 50),
            Array(2043107, "15%单手斧攻击卷轴", 1, 60),
            Array(2043120, "50%单手斧攻击卷轴", 1, 1800),
            Array(2043103, "100%单手斧攻击卷轴", 1, 3000),
            Array(2043104, "70%单手斧攻击诅咒卷轴", 1, 20),
            Array(2043105, "30%单手斧攻击诅咒卷轴", 1, 20),
            Array(2043111, "70%单手斧命中率卷轴", 1, 10),
            Array(2043112, "60%单手斧命中率卷轴", 1, 10),
            Array(2043113, "30%单手斧命中率卷轴", 1, 10),
            Array(2043114, "10%单手斧命中率卷轴", 1, 10),
            Array(2043118, "65%单手斧命中卷轴", 1, 15),
            Array(2043119, "15%单手斧命中卷轴", 1, 15),
        )
    ),
    Array(
        "单手钝器",
        Array(
            Array(2043200, "100%单手钝器攻击卷轴", 1, 2),
            Array(2043201, "60%单手钝器攻击卷轴", 1, 100),
            Array(2043206, "65%单手钝器攻击卷轴", 1, 120),
            Array(2043217, "100%单手钝器攻击卷轴", 1, 320),
            Array(2043202, "10%单手钝器攻击卷轴", 1, 50),
            Array(2043207, "15%单手钝器攻击卷轴", 1, 60),
            Array(2043220, "50%单手钝器攻击卷轴", 1, 1800),
            Array(2043203, "100%单手钝器攻击卷轴", 1, 3000),
            Array(2043204, "70%单手钝器攻击诅咒卷轴", 1, 20),
            Array(2043205, "30%单手钝器攻击诅咒卷轴", 1, 20),
            Array(2043211, "70%单手钝器命中率卷轴 ", 1, 10),
            Array(2043212, "60%单手钝器命中率卷轴", 1, 10),
            Array(2043213, "30%单手钝器命中率卷轴", 1, 10),
            Array(2043214, "10%单手钝器命中率卷轴", 1, 10),
            Array(2043218, "65%单手钝器命中卷轴", 1, 15),
            Array(2043219, "15%单手钝器命中卷轴", 1, 15),
            Array(2043210, "100%单手钝器命中", 1, 2),
            Array(2043110, "100%单手钝器命中", 1, 2),
        )
    ),
    Array(
        "短剑",
        Array(
            Array(2043300, "100%短剑攻击卷轴", 1, 2),
            Array(2043301, "60%短剑攻击卷轴", 1, 100),
            Array(2043306, "65%短剑攻击卷轴", 1, 120),
            Array(2043302, "10%短剑攻击卷轴", 1, 50),
            Array(2043307, "15%短剑攻击卷轴", 1, 60),
            Array(2043312, "100%短剑攻击卷轴", 1, 320),
            Array(2043313, "50%短剑攻击卷轴", 1, 1800),
            Array(2043303, "100%短剑攻击卷轴", 1, 3000),
            Array(2043304, "70%短剑攻击诅咒卷轴", 1, 20),
            Array(2043305, "30%短剑攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "短杖",
        Array(
            Array(2043700, "100%短杖魔力卷轴", 1, 2),
            Array(2043701, "60%短杖魔力卷轴", 1, 100),
            Array(2043706, "65%短杖魔力卷轴", 1, 120),
            Array(2043702, "10%短杖魔力卷轴", 1, 50),
            Array(2043707, "15%短杖魔力卷轴", 1, 60),
            Array(2043712, "100%短杖魔力卷轴", 1, 320),
            Array(2043713, "50%短仗攻击卷轴", 1, 1800),
            Array(2043703, "100%短杖魔力卷轴", 1, 3000),
            Array(2043704, "70%短杖魔力诅咒卷轴", 1, 20),
            Array(2043705, "30%短杖魔力诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "长杖",
        Array(
            Array(2043800, "100%长杖魔力卷轴", 1, 2),
            Array(2043801, "60%长杖魔力卷轴", 1, 100),
            Array(2043806, "65%长杖魔力卷轴", 1, 120),
            Array(2043802, "10%长杖魔力卷轴", 1, 50),
            Array(2043807, "15%长杖魔力卷轴", 1, 60),
            Array(2043812, "100%长仗攻击卷轴", 1, 320),
            Array(2043813, "50%长仗攻击卷轴", 1, 1800),
            Array(2043803, "100%长杖魔力卷轴", 1, 3000),
            Array(2043804, "70%长杖魔力诅咒卷轴", 1, 20),
            Array(2043805, "30%长杖魔力诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "双手剑",
        Array(
            Array(2044000, "100%双手剑攻击卷轴", 1, 2),
            Array(2044001, "60%双手剑攻击卷轴", 1, 100),
            Array(2044006, "65%双手剑攻击卷轴", 1, 120),
            Array(2044002, "10%双手剑攻击卷轴", 1, 50),
            Array(2044015, "10%双手剑攻击卷轴", 1, 50),
            Array(2044007, "15%双手剑攻击卷轴", 1, 60),
            Array(2044025, "100%双手剑攻击卷轴", 1, 320),
            Array(2044028, "50%双手剑攻击卷轴", 1, 1800),
            Array(2044003, "100%双手剑攻击卷轴", 1, 3000),
            Array(2044004, "70%双手剑攻击诅咒卷轴", 1, 20),
            Array(2044005, "30%双手剑攻击诅咒卷轴", 1, 20),
            Array(2044010, "100%双手剑命中率卷轴 ", 1, 2),
            Array(2044011, "70%双手剑命中率卷轴 ", 1, 10),
            Array(2044012, "60%双手剑命中率卷轴", 1, 10),
            Array(2044013, "30%双手剑命中率卷轴 ", 1, 10),
            Array(2044014, "10%双手剑命中率卷轴", 1, 10),
            Array(2044026, "65%双手剑命中卷轴", 1, 15),
            Array(2044027, "15%双手剑命中卷轴", 1, 15),
        )
    ),
    Array(
        "双手斧",
        Array(
            Array(2044100, "100%双手斧攻击卷轴", 1, 2),
            Array(2044101, "60%双手斧攻击卷轴", 1, 100),
            Array(2044106, "65%双手斧攻击卷轴", 1, 120),
            Array(2044102, "10%双手斧攻击卷轴", 1, 50),
            Array(2044107, "15%双手斧攻击卷轴", 1, 60),
            Array(2044117, "100%双手斧攻击卷轴", 1, 320),
            Array(2044120, "50%双手斧攻击卷轴", 1, 1800),
            Array(2044103, "100%双手斧攻击卷轴", 1, 3000),
            Array(2044104, "70%双手斧攻击诅咒卷轴", 1, 20),
            Array(2044105, "30%双手斧攻击诅咒卷轴", 1, 20),
            Array(2044110, "100%双手斧命中率卷轴 ", 1, 2),
            Array(2044111, "70%双手斧命中率卷轴 ", 1, 10),
            Array(2044112, "60%双手斧命中率卷轴", 1, 10),
            Array(2044113, "30%双手斧命中率卷轴", 1, 10),
            Array(2044114, "10%双手斧命中率卷轴 ", 1, 10),
            Array(2044118, "65%双手斧命中卷轴", 1, 15),
            Array(2044119, "15%双手斧命中卷轴", 1, 15),
        )
    ),
    Array(
        "双手钝器",
        Array(
            Array(2044200, "100%双手钝器攻击卷轴", 1, 2),
            Array(2044201, "60%双手钝器攻击卷轴", 1, 100),
            Array(2044206, "65%双手钝器攻击卷轴", 1, 120),
            Array(2044202, "10%双手钝器攻击卷轴", 1, 50),
            Array(2044207, "15%双手钝器攻击卷轴", 1, 60),
            Array(2044217, "100%双手钝器攻击卷轴", 1, 320),
            Array(2044220, "50%双手钝器攻击卷轴", 1, 1800),
            Array(2044203, "100%双手钝器攻击卷轴", 1, 3000),
            Array(2044204, "70%双手钝器攻击诅咒卷轴", 1, 20),
            Array(2044205, "30%双手钝器攻击诅咒卷轴", 1, 20),
            Array(2044210, "100%双手钝器命中率卷轴", 1, 2),
            Array(2044211, "70%双手钝器命中率卷轴", 1, 10),
            Array(2044212, "60%双手钝器命中率卷轴", 1, 10),
            Array(2044213, "30%双手钝器命中率卷轴", 1, 10),
            Array(2044214, "10%双手钝器命中率卷轴", 1, 10),
            Array(2044218, "65%双手钝器命中卷轴", 1, 15),
            Array(2044219, "15%双手钝器命中卷轴", 1, 15),
        )
    ),
    Array(
        "枪",
        Array(
            Array(2044300, "100%枪攻击卷轴", 1, 2),
            Array(2044301, "60%枪攻击卷轴", 1, 100),
            Array(2044306, "65%枪攻击卷轴", 1, 120),
            Array(2044302, "10%枪攻击卷轴", 1, 50),
            Array(2044307, "15%枪攻击卷轴", 1, 60),
            Array(2044317, "100%枪攻击卷轴", 1, 320),
            Array(2044320, "50%枪攻击卷轴", 1, 1800),
            Array(2044303, "100%枪攻击卷轴", 1, 3000),
            Array(2044304, "70%枪攻击诅咒卷轴", 1, 20),
            Array(2044305, "30%枪攻击诅咒卷轴", 1, 20),
            Array(2044310, "100%枪命中率卷轴 ", 1, 2),
            Array(2044311, "70%枪命中率卷轴 ", 1, 10),
            Array(2044312, "60%枪命中率卷轴", 1, 10),
            Array(2044313, "30%枪命中率卷轴", 1, 10),
            Array(2044314, "10%枪命中率卷轴", 1, 10),
            Array(2044318, "65%枪命中卷轴", 1, 15),
            Array(2044319, "15%枪命中卷轴", 1, 15),
        )
    ),
    Array(
        "矛",
        Array(
            Array(2044400, "100%矛攻击卷轴", 1, 2),
            Array(2044401, "60%矛攻击卷轴", 1, 100),
            Array(2044406, "65%矛攻击卷轴", 1, 120),
            Array(2044402, "10%矛攻击卷轴", 1, 50),
            Array(2044407, "15%矛攻击卷轴", 1, 65),
            Array(2044417, "100%矛攻击卷轴", 1, 320),
            Array(2044420, "50%矛攻击卷轴", 1, 1500),
            Array(2044403, "70%矛攻击诅咒卷轴", 1, 1800),
            Array(2044404, "70%矛攻击诅咒卷轴", 1, 20),
            Array(2044405, "30%矛攻击诅咒卷轴", 1, 20),
            Array(2044410, "100%矛命中率卷轴", 1, 2),
            Array(2044411, "70%矛命中率卷轴", 1, 10),
            Array(2044412, "60%矛命中率卷轴", 1, 10),
            Array(2044413, "30%矛命中率卷轴", 1, 10),
            Array(2044414, "10%矛命中率卷轴 ", 1, 10),
            Array(2044418, "65%矛命中卷轴", 1, 15),
            Array(2044419, "15%矛命中卷轴", 1, 15),
        )
    ),
    Array(
        "弓",
        Array(
            Array(2044500, "100%弓攻击卷轴", 1, 2),
            Array(2044501, "60%弓攻击卷轴", 1, 100),
            Array(2044506, "65%弓攻击卷轴", 1, 120),
            Array(2044502, "10%弓攻击卷轴", 1, 50),
            Array(2044507, "15%弓攻击卷轴", 1, 60),
            Array(2044512, "100%弓攻击卷轴", 1, 320),
            Array(2044513, "50%弓攻击卷轴", 1, 1500),
            Array(2044503, "100%弓攻击卷轴", 1, 3000),
            Array(2044504, "70%弓攻击诅咒卷轴", 1, 20),
            Array(2044505, "30%弓攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "弩",
        Array(
            Array(2044601, "100%弩攻击卷轴", 1, 2),
            Array(2044601, "60%弩攻击卷轴", 1, 100),
            Array(2044606, "65%弩攻击卷轴", 1, 120),
            Array(2044602, "10%弩攻击卷轴", 1, 50),
            Array(2044607, "15%弩攻击卷轴", 1, 60),
            Array(2044612, "100%弩攻击卷轴", 1, 320),
            Array(2044613, "50%弩攻击卷轴", 1, 1500),
            Array(2044603, "100%弩攻击卷轴", 1, 3000),
            Array(2044604, "70%弩攻击诅咒卷轴", 1, 20),
            Array(2044605, "30%弩攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "拳套",
        Array(
            Array(2044700, "100%拳套攻击卷轴", 1, 2),
            Array(2044701, "60%拳套攻击卷轴", 1, 100),
            Array(2044706, "65%拳套攻击卷轴", 1, 120),
            Array(2044702, "10%拳套攻击卷轴", 1, 50),
            Array(2044707, "15%拳套攻击卷轴", 1, 60),
            Array(2044703, "100%拳套攻击卷轴", 1, 3000),
            Array(2044704, "70%拳套攻击诅咒卷轴", 1, 20),
            Array(2044705, "30%拳套攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "拳甲",
        Array(
            Array(2044800, "100%拳甲攻击卷轴", 1, 2),
            Array(2044801, "60%拳甲攻击卷轴", 1, 100),
            Array(2044811, "65%拳甲攻击卷轴", 1, 120),
            Array(2044802, "10%拳甲攻击卷轴", 1, 50),
            Array(2044812, "15%拳甲攻击卷轴", 1, 60),
            Array(2044712, "100%指节攻击卷轴", 1, 320),
            Array(2044713, "50%指节攻击卷轴", 1, 1300),
            Array(2044817, "50%拳甲攻击卷轴", 1, 1500),
            Array(2044805, "100%拳甲命中率卷轴", 1, 1),
            Array(2044806, "70%拳甲命中率卷轴", 1, 10),
            Array(2044807, "60%拳甲命中率卷轴", 1, 10),
            Array(2044808, "30%拳甲命中率卷轴", 1, 10),
            Array(2044809, "30%拳甲命中率卷轴", 1, 10),
            Array(2044813, "65%拳甲命中卷轴", 1, 10),
            Array(2044814, "15%拳甲命中卷轴", 1, 10),
            Array(2044815, "100%拳甲命中卷轴", 1, 200),
            Array(2044803, "70%拳甲攻击诅咒卷轴", 1, 20),
            Array(2044804, "30%拳甲攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "短枪",
        Array(
            Array(2044900, "100%短枪攻击卷轴", 1, 2),
            Array(2044901, "60%短枪攻击卷轴", 1, 100),
            Array(2044906, "65%短枪攻击卷轴", 1, 120),
            Array(2044902, "10%短枪攻击卷轴", 1, 50),
            Array(2044907, "15%短枪攻击卷轴", 1, 60),
            Array(2044908, "100%短枪攻击卷轴", 1, 320),
            Array(2044910, "50%短枪攻击卷轴", 1, 1500),
            Array(2044903, "70%短枪攻击诅咒卷轴", 1, 20),
            Array(2044904, "30%短枪攻击诅咒卷轴", 1, 20),
        )
    ),
    Array(
        "宠物",
        Array(
            Array(2048000, "100%宠物速度卷轴", 1, 1),
            Array(2048001, "60%宠物速度卷轴", 1, 20),
            Array(2048002, "10%宠物速度卷轴", 1, 20),
            Array(2048003, "100%宠物速度卷轴", 1, 1),
            Array(2048004, "60%宠物跳跃力卷轴", 1, 20),
            Array(2048005, "10%宠物跳跃力卷轴", 1, 20),
            Array(2048006, "65%宠物移动卷轴", 1, 25),
            Array(2048007, "15%宠物移动卷轴", 1, 25),
            Array(2048008, "65%宠物跳跃卷轴", 1, 25),
            Array(2048009, "15%宠物跳跃卷轴", 1, 25),
            Array(2048010, "60%宠物力量卷轴", 1, 50),
            Array(2048011, "60%宠物智力卷轴", 1, 50),
            Array(2048012, "60%宠物敏捷卷轴", 1, 50),
            Array(2048013, "60%宠物幸运卷轴", 1, 50)
        )
    ),
    Array(
        "配饰",
        Array(
            Array(2049200, "70%配饰力量卷轴", 1, 20),
            Array(2049201, "30%配饰力量卷轴", 1, 20),
            Array(2049202, "70%配饰敏捷卷轴", 1, 20),
            Array(2049203, "30%配饰敏捷卷轴", 1, 20),
            Array(2049204, "70%配饰智力卷轴", 1, 20),
            Array(2049205, "30%配饰智力卷轴", 1, 20),
            Array(2049206, "70%配饰幸运卷轴", 1, 20),
            Array(2049207, "30%配饰幸运卷轴", 1, 20),
            Array(2049208, "70%配饰HP卷轴", 1, 20),
            Array(2049209, "30%配饰HP卷轴", 1, 20),
            Array(2049210, "70%配饰MP卷轴", 1, 20),
            Array(2049211, "30%配饰MP卷轴", 1, 20)
        )
    ),
    Array(
        "特殊",
        Array(
            Array(2049000, "1%白医卷轴", 1, 10),
            Array(2049001, "3%白医卷轴", 1, 30),
            Array(2049002, "5%白医卷轴", 1, 50),
            Array(2049003, "20%白医卷轴", 1, 200),
            Array(2049100, "60%混沌卷轴", 1, 150),
            Array(2049115, "50%正向混沌卷轴", 1, 3000),
            Array(2340000, "祝福卷轴", 1, 150)
        )
    )
);

const pieceId = 4001136;

var operation; // 0: 分解卷轴，1: 合成卷轴
var status = 0;
var itemList;
var itemId;
var itemName;
var pieceQty;

function start() {
    var text = "欢迎使用卷轴碎片商店，请选择您要执行的操作: \r\n";
    text += "#L0##b分解卷轴#k#l\r\n";
    text += "#L1##b合成卷轴#k#l\r\n";
    cm.sendSimple(text);
}

function action(mode, type, selection) {
    if (mode > 0) {
        status++;
    } else {
        cm.dispose();
        return;
    }

    if (status == 1) {
        operation = selection;
        if (operation == 0) {
            var text = "请选择要分解的卷轴: \r\n";
            itemList = Array();
            for (var i = 0; i < itemGroupList.length; i++) {
                const mItemList = itemGroupList[i][1];
                for (var j = 0; j < mItemList.length; j++) {
                    const itemId = mItemList[j][0];
                    const itemName = mItemList[j][1];
                    const itemQty = cm.getItemQuantity(itemId);
                    if (itemQty > 0) {
                        text += `#L${itemList.length}##i${itemId}:##b${itemName}#k\t拥有数量: #r${itemQty}#k#l\r\n`;
                        itemList.push(mItemList[j]);
                        if (itemList.length >= 128) {
                            // 只显示前128种背包中存在的卷轴
                            break;
                        }
                    }
                }
            }

            if (itemList.length == 0) {
                cm.sendOk("背包中没有可以分解的卷轴！");
                cm.dispose();
                return;
            } else {
                cm.sendSimple(text);
            }
        } else {
            const pieceQty = cm.getItemQuantity(pieceId);
            var text = `您拥有#r${pieceQty}#k个卷轴碎片，请选择要合成的卷轴种类: \r\n`;
            for (var i = 0; i < itemGroupList.length; i++) {
                const groupName = itemGroupList[i][0];
                text += `#L${i}##b${groupName}#k\r\n`;
            }
            cm.sendSimple(text);
        }
    } else {
        if (operation == 0) {
            if (status == 2) {
                itemId = itemList[selection][0];
                itemName = itemList[selection][1];
                pieceQty = itemList[selection][2];
                var itemQty = cm.getItemQuantity(itemId);
                var text = `您想要分解多少个#i${itemId}:##b${itemName}#k？\r\n`;
                text += `拥有数量: #r${itemQty}#k\t分解比例: #r1卷轴=${pieceQty}碎片#k\r\n`;
                cm.sendGetNumber(text, 1, 1, itemQty);
            } else if (status == 3) {
                var qty = selection > 0 ? selection : selection < 0 ? -selection : 1;
                var itemQty = cm.getItemQuantity(itemId);
                if (qty > itemQty) {
                    cm.sendOk(`背包中#i${itemId}:##b#t${itemId}##k的数量不足！`);
                    cm.dispose();
                    return;
                } else {
                    const totalPieceQty = qty * pieceQty;
                    if (!cm.canHold(pieceId, totalPieceQty)) {
                        cm.sendOk("背包中没有足够的空间！");
                        cm.dispose();
                    } else {
                        cm.gainItem(pieceId, totalPieceQty);
                        cm.gainItem(itemId, -qty);

                        var text = `分解成功！\r\n`;
                        text += `分解了#r${qty}#k个#i${itemId}:##b${itemName}#k\r\n`;
                        text += `获得了#r${totalPieceQty}#k个#i${pieceId}:##b#t${pieceId}##k\r\n`;
                        cm.sendOk(text);
                        cm.dispose();
                    }
                }
            }
        } else {
            if (status == 2) {
                const pieceQty = cm.getItemQuantity(pieceId);
                var text = `您拥有#r${pieceQty}#k个卷轴碎片，请选择要合成的卷轴: \r\n`;

                itemList = itemGroupList[selection][1];
                for (var i = 0; i < itemList.length; i++) {
                    const itemId = itemList[i][0];
                    const itemName = itemList[i][1];
                    const pieceQty = itemList[i][3];
                    text += `#L${i}##i${itemId}:##b${itemName}#k\t#r${pieceQty}碎片=1卷轴#k#l\r\n\r\n`;
                }

                cm.sendSimple(text);
            } else if (status == 3) {
                itemId = itemList[selection][0];
                itemName = itemList[selection][1];
                pieceQty = itemList[selection][3];
                var havePieceQty = cm.getItemQuantity(pieceId);
                var text = `您拥有#r${havePieceQty}#k个卷轴碎片，要合成多少个#i${itemId}:##b${itemName}#k？\r\n`;
                text += `合成比例: #r${pieceQty}碎片=1卷轴#k\r\n`;
                cm.sendGetNumber(text, 1, 1, parseInt(Math.min(32767 / pieceQty, 100)));
            } else if (status == 4) {
                var qty = selection > 0 ? selection : selection < 0 ? -selection : 1;
                const needPieceQty = qty * pieceQty;
                const havePieceQty = cm.getItemQuantity(pieceId);
                if (needPieceQty > havePieceQty) {
                    cm.sendOk(
                        `背包中#i${pieceId}:##b#t${pieceId}##k的数量不足#r${needPieceQty}#k个！`
                    );
                    cm.dispose();
                } else if (!cm.canHold(itemId, qty)) {
                    cm.sendOk("背包中没有足够的空间！");
                    cm.dispose();
                } else {
                    cm.gainItem(itemId, qty);
                    cm.gainItem(pieceId, -needPieceQty);

                    var text = `合成成功！\r\n`;
                    text += `获得了#r${qty}#k个#i${itemId}:##b${itemName}#k\r\n`;
                    text += `消耗了#r${needPieceQty}#k个#i${pieceId}:##b#t${pieceId}##k\r\n`;
                    cm.sendOk(text);
                    cm.dispose();
                }
            }
        }
    }
}
